app/controllers/shopping_lists_controller.rb

  def index
    @shopping_lists = ShoppingList.all
---
SELECT "shopping_lists".* FROM "shopping_lists"

  def create
    @shopping_list = ShoppingList.new(shopping_list_params)

    respond_to do |format|
      if @shopping_list.save
---
INSERT INTO "shopping_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test list"], ["description", "stuff i need"], ["created_at", "2015-03-27 19:45:12.434487"], ["updated_at", "2015-03-27 19:45:12.434487"]]

  def destroy
    @shopping_list.destroy
---
DELETE FROM "shopping_lists" WHERE "shopping_lists"."id" = ?  [["id", 1]]

    def set_shopping_list
      @shopping_list = ShoppingList.find(params[:id])
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = ? LIMIT 1  [["id", 1]]